Revit 2027 API
TableCellStyleOverrideOptions.SetAllOverrides Method
 Sets all overrides to a specific value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAllOverrides(
	bool bOverride
)
Public Sub SetAllOverrides (
	bOverride As Boolean
)
public:
void SetAllOverrides(
	bool bOverride
)
member SetAllOverrides :
        bOverride : bool -> unit
Parameters
bOverride Boolean
 The value that will be assigned to all the overrides.
See Also
Reference
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace